In [1]:
import numpy as np 
import pandas as pd
import seaborn as sns

In [2]:
SEED = 42

In [3]:
train_data = pd.read_csv("data/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test_data = pd.read_csv("data/test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
test_data['Age'].fillna(round((test_data['Age'].mean())), inplace = True)
train_data['Age'].fillna(round((train_data['Age'].mean())), inplace = True)

In [7]:
test_data['Fare'] = test_data['Fare'].fillna(test_data['Fare'].mean())

In [8]:
train_data = train_data.drop(columns=['Name'], axis=1)
test_data = test_data.drop(columns=['Name'], axis=1)

In [9]:
train_data['Sex'] = train_data['Sex'].apply(lambda x: 0 if x == 'male' else 1)
test_data['Sex'] = test_data['Sex'].apply(lambda x: 0 if x == 'male' else 1)

In [10]:
train_data = train_data.drop(columns=['Ticket'], axis=1)
test_data = test_data.drop(columns=['Ticket'], axis=1)

In [11]:
train_data = train_data.drop(columns=['Cabin'], axis=1)
test_data = test_data.drop(columns=['Cabin'], axis=1)

In [12]:
def embarked(x):
    if x == 'Q':
        return 0
    elif x == 'C':
        return 1
    else:
        return 2

In [13]:
train_data['Embarked'] = train_data['Embarked'].apply(embarked)
test_data['Embarked'] = test_data['Embarked'].apply(embarked)

In [14]:
X = train_data.drop("Survived", axis=1)
y = train_data['Survived'].values

In [15]:
X.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1       3    0  22.0      1      0   7.2500         2
1            2       1    1  38.0      1      0  71.2833         1
2            3       3    1  26.0      0      0   7.9250         2
3            4       1    1  35.0      1      0  53.1000         2
4            5       3    0  35.0      0      0   8.0500         2

In [16]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import GradientBoostingClassifier

In [17]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state=SEED)

In [18]:
gdb = GradientBoostingClassifier(random_state=SEED)
gdb.fit(X_train, y_train)

GradientBoostingClassifier(criterion='friedman_mse', init=None,
                           learning_rate=0.1, loss='deviance', max_depth=3,
                           max_features=None, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=100,
                           n_iter_no_change=None, presort='auto',
                           random_state=42, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0,
                           warm_start=False)

In [19]:
y_pred = gdb.predict(test_data)

In [20]:
sub = pd.read_csv('data/gender_submission.csv')
sub.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [21]:
sub['Survived'] = y_pred
sub.to_csv("titanic_results-5.csv", index=False)
sub.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         0